In [4]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

SERIES

In [2]:
#Series is like an array but the values are indexed
obj = Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [3]:
obj.values

array([ 3,  6,  9, 12])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
#We can change the index values
ww2_cas = Series([8700000,4300000,3000000,2100000,400000],index=['USSR','Germany','China','Japan','USA'])
ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [7]:
ww2_cas['USA']

400000

In [8]:
#Check which countries had casulty of greater than 4 million
ww2_cas[ww2_cas > 4000000]

USSR       8700000
Germany    4300000
dtype: int64

In [11]:
'USSR' in ww2_cas #case sensitive

True

In [12]:
#Converting series into a dictionary
ww2_dict = ww2_cas.to_dict()
ww2_dict

{'China': 3000000,
 'Germany': 4300000,
 'Japan': 2100000,
 'USA': 400000,
 'USSR': 8700000}

In [13]:
#Converting Dict to Series
ww2_series = Series(ww2_dict)
ww2_series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [14]:
countries = ['China','Germany','Japan','USSR','USA','Argentina']
obj2 = Series(ww2_dict,index = countries)
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USSR         8700000.0
USA           400000.0
Argentina          NaN
dtype: float64

In [15]:
#finding out the null value
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USSR         False
USA          False
Argentina     True
dtype: bool

In [16]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USSR          True
USA           True
Argentina    False
dtype: bool

In [17]:
ww2_series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [18]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USSR         8700000.0
USA           400000.0
Argentina          NaN
dtype: float64

In [19]:
#Adding arrays is always based on index 
ww2_series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [21]:
#Labeling the series
obj2.name ='World War 2 casualties'
obj2.index.name = 'Countries'
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USSR         8700000.0
USA           400000.0
Argentina          NaN
Name: World War 2 casualties, dtype: float64

DATAFRAME

In [22]:
import webbrowser
website ='http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

In [25]:
#Pandas has a built-in function to read data from clip board and save it in dataframe
nfl_frame = pd.read_clipboard()

In [34]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [35]:
#To get the list of columns
nfl_frame.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [36]:
nfl_frame.Rank

0    1
1    2
2    3
3    4
4    5
Name: Rank, dtype: int64

In [37]:
#nfl_frame.First NFL Season wont work as the column name has spaces. So use the below command
nfl_frame['First NFL Season']

0    1960
1    1921
2    1920
3    1966
4    1960
Name: First NFL Season, dtype: int64

In [38]:
#Creating a subdata frame from nfl_frame
DataFrame(nfl_frame,columns=['Team','First NFL Season','GP'])

                      Team  First NFL Season     GP
0           Dallas Cowboys              1960    882
1        Green Bay Packers              1921  1,336
2            Chicago Bears              1920  1,370
3           Miami Dolphins              1966    800
4  New England Patriots[b]              1960    884

In [39]:
#Creating a column not present in the original dataframe.
DataFrame(nfl_frame,columns=['Team','First NFL Season','GP','Stadium'])

                      Team  First NFL Season     GP  Stadium
0           Dallas Cowboys              1960    882      NaN
1        Green Bay Packers              1921  1,336      NaN
2            Chicago Bears              1920  1,370      NaN
3           Miami Dolphins              1966    800      NaN
4  New England Patriots[b]              1960    884      NaN

In [40]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [41]:
#To retrieve first few rows in a dataframe
nfl_frame.head() #by Default 5

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [42]:
#specifiy the number of rows you want to see and head() will retrieve those many no.of entries from start
nfl_frame.head(3)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North

In [43]:
#to retrieve the last rows 
nfl_frame.tail() #by default 5

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [44]:
nfl_frame.tail(2)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [46]:
#to extract a particular row using their index
nfl_frame.loc[nfl_frame.index[[0, 2]]]

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North

In [48]:
#.loc allows to see rows and data defined to only one column
nfl_frame.loc[nfl_frame.index[[0, 2]],'Team']

0    Dallas Cowboys
2     Chicago Bears
Name: Team, dtype: object

In [49]:
#to see row data for more than one column we use iloc
nfl_frame.iloc[[0, 2], nfl_frame.columns.get_indexer(['Team', 'GP','Division'])]

             Team     GP   Division
0  Dallas Cowboys    882   NFC East
2   Chicago Bears  1,370  NFC North

In [50]:
# Assigning values to Stadium column
nfl_frame['Stadium'] = "Levi's Stadium" #if there is a ' in the name itself then keep it under "" and vice versa

In [51]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East,Levi's Stadium
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North,Levi's Stadium
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North,Levi's Stadium
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East,Levi's Stadium
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East,Levi's Stadium

In [62]:
#to insert number to stadium column
nfl_frame['Stadium'] = np.arange(5)
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East,0
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North,1
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North,2
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East,3
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East,4

In [63]:
#Inserting string values in "Stadium" column
stadiums = Series (["Levi's Stadium","AT&T Stadium"],index = [4,0])

In [64]:
stadiums

4    Levi's Stadium
0      AT&T Stadium
dtype: object

In [65]:
nfl_frame["Stadium"] = stadiums

In [66]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East,AT&T Stadium
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North,NaN
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North,NaN
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East,NaN
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East,Levi's Stadium

Note: Pandas assign NaN to Null values

In [67]:
#deleting a column
del nfl_frame['Stadium']
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [68]:
#Creating a dictionary
data = {'City':['SF','LA','NYC'],'Population':[837000,3880000,8400000]}

In [70]:
city_frame = DataFrame(data)

In [71]:
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [72]:
website = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.html'
webbrowser.open(website)

True

Index Object

In [74]:
my_ser = Series([1,2,3,4],index=['A','B','C','D'])

my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [75]:
my_index = my_ser.index
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [76]:
my_index[2]

'C'

In [77]:
my_index[2:]

Index(['C', 'D'], dtype='object')

#if we want to change the index
my_index[0] = 'Z'
#Gives error: indexes does not support mutable operations

REINDEXING

In [78]:
from numpy.random import randn

In [79]:
ser1 = Series ([1,2,3,4],index=['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [81]:
ser2 =ser1.reindex(['A','B','C','D','E','F'])

In [82]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [83]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [84]:
ser3 = Series(['USA','Mexico','Canada'],index = [0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [85]:
ranger = range(15)
ranger

range(0, 15)

In [88]:
#Forward filling 0=USA so 1-4 -->USA then 5= Mexico so 5-9 -->Mexico 10=Canada so 11-14--> Canada
ser3.reindex(ranger,method ='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [89]:
#back fill
ser3.reindex(ranger,method ='bfill')

0        USA
1     Mexico
2     Mexico
3     Mexico
4     Mexico
5     Mexico
6     Canada
7     Canada
8     Canada
9     Canada
10    Canada
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [90]:
dframe = DataFrame(randn(25).reshape((5,5)),index = ['A','B','D','E','F'],
                    columns = ['col1','col2','col3','col4','col5'])

In [91]:
dframe

       col1      col2      col3      col4      col5
A  0.464404  0.185500  0.761780 -0.376447  0.838652
B -0.302726 -0.066317 -0.673579 -0.120105  0.970098
D  0.356341  0.405982  0.139188 -0.306935 -0.809055
E -1.231154 -1.468462 -1.491416  0.355011  0.090433
F -1.591542 -0.526240 -0.843238 -0.146885 -0.489272

In [92]:
#reindexing to insert C in row index
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [93]:
dframe2

       col1      col2      col3      col4      col5
A  0.464404  0.185500  0.761780 -0.376447  0.838652
B -0.302726 -0.066317 -0.673579 -0.120105  0.970098
C       NaN       NaN       NaN       NaN       NaN
D  0.356341  0.405982  0.139188 -0.306935 -0.809055
E -1.231154 -1.468462 -1.491416  0.355011  0.090433
F -1.591542 -0.526240 -0.843238 -0.146885 -0.489272

In [94]:
new_columns = ['col1','col2','col3','col4','col5','col6']
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  0.464404  0.185500  0.761780 -0.376447  0.838652   NaN
B -0.302726 -0.066317 -0.673579 -0.120105  0.970098   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.356341  0.405982  0.139188 -0.306935 -0.809055   NaN
E -1.231154 -1.468462 -1.491416  0.355011  0.090433   NaN
F -1.591542 -0.526240 -0.843238 -0.146885 -0.489272   NaN

In [95]:
dframe

       col1      col2      col3      col4      col5
A  0.464404  0.185500  0.761780 -0.376447  0.838652
B -0.302726 -0.066317 -0.673579 -0.120105  0.970098
D  0.356341  0.405982  0.139188 -0.306935 -0.809055
E -1.231154 -1.468462 -1.491416  0.355011  0.090433
F -1.591542 -0.526240 -0.843238 -0.146885 -0.489272

In [106]:
dframe.reindex(['A','B','C','D','E','F'], columns = new_columns,fill_value = 0)

       col1      col2      col3      col4      col5  col6
A  0.464404  0.185500  0.761780 -0.376447  0.838652   0.0
B -0.302726 -0.066317 -0.673579 -0.120105  0.970098   0.0
C  0.000000  0.000000  0.000000  0.000000  0.000000   0.0
D  0.356341  0.405982  0.139188 -0.306935 -0.809055   0.0
E -1.231154 -1.468462 -1.491416  0.355011  0.090433   0.0
F -1.591542 -0.526240 -0.843238 -0.146885 -0.489272   0.0

DROP ENTRY

In [7]:
ser4 = Series(np.arange(3),index=['a','b','c'])
ser4

a    0
b    1
c    2
dtype: int64

In [8]:
#to drop an index label
ser4.drop('b')

a    0
c    2
dtype: int64

In [12]:
dframe1= DataFrame(np.arange(9).reshape(3,3),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [16]:
dframe3= dframe1.drop('LA')
dframe3

    pop  size  year
SF    0     1     2
NY    6     7     8

In [14]:
#Drop doesn't affect the original data frame but drop can be saved to another data frame.
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [17]:
#drop the column
dframe1.drop('year',axis=1) #axis=0 means rows ,axis=1 means columns

    pop  size
SF    0     1
LA    3     4
NY    6     7

SELECTING ENTRIES

FOR SERIES

In [18]:
ser5 = Series(np.arange(3),index=['A','B','C'])
ser5 = 2*ser5

ser5

A    0
B    2
C    4
dtype: int64

In [19]:
#Selecting the elements as per their index name
ser5['A']

0

In [20]:
#using index number
ser5[1]

2

In [22]:
#by index range
ser5[0:2]

A    0
B    2
dtype: int64

In [24]:
#by passing the index values
ser5[['A','B']]

A    0
B    2
dtype: int64

In [26]:
#by using conditions
ser5[ser5>3]

C    4
dtype: int64

In [28]:
#we can also replace the values satisfying the condition
ser5[ser5>3] = 10

ser5

A     0
B     2
C    10
dtype: int64

FOR DATAFRAME

In [29]:
dframe3 = DataFrame(np.arange(25).reshape((5,5)),index=['SF','LA','NY','DC','IL'],
                    columns=['A','B','C','D','E'])
dframe3

     A   B   C   D   E
SF   0   1   2   3   4
LA   5   6   7   8   9
NY  10  11  12  13  14
DC  15  16  17  18  19
IL  20  21  22  23  24

In [30]:
#Selecting data using column name
dframe3['B']

SF     1
LA     6
NY    11
DC    16
IL    21
Name: B, dtype: int64

In [32]:
dframe3[['B','E','C']]

     B   E   C
SF   1   4   2
LA   6   9   7
NY  11  14  12
DC  16  19  17
IL  21  24  22

In [34]:
#selecting entries based on a condition
dframe3[dframe3['C']>8]

     A   B   C   D   E
NY  10  11  12  13  14
DC  15  16  17  18  19
IL  20  21  22  23  24

In [35]:
#to get a boolean dataframe
dframe3 > 10

        A      B      C      D      E
SF  False  False  False  False  False
LA  False  False  False  False  False
NY  False   True   True   True   True
DC   True   True   True   True   True
IL   True   True   True   True   True

In [37]:
dframe3.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [40]:
dframe3.iloc[2]

A    10
B    11
C    12
D    13
E    14
Name: NY, dtype: int64

DATA ALIGNMENT

In [41]:
ser6 = Series([0,1,2],index=['A','B','C'])
ser6

A    0
B    1
C    2
dtype: int64

In [42]:
ser7 = Series([3,4,5,6],index=['A','B','C','D'])
ser7

A    3
B    4
C    5
D    6
dtype: int64

In [43]:
ser6 + ser7

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [45]:
dframe4 = DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'), index=['NY','LA'])
dframe4

    A  B
NY  0  1
LA  2  3

In [46]:
dframe5 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'), index=['NY','SF','LA'])
dframe5

    A  D  C
NY  0  1  2
SF  3  4  5
LA  6  7  8

In [47]:
dframe4 + dframe5

      A   B   C   D
LA  8.0 NaN NaN NaN
NY  0.0 NaN NaN NaN
SF  NaN NaN NaN NaN

In [48]:
 dframe4.add(dframe5,fill_value=0)

      A    B    C    D
LA  8.0  3.0  8.0  7.0
NY  0.0  1.0  2.0  1.0
SF  3.0  NaN  5.0  4.0

In [50]:
ser8 = dframe5.iloc[0]
ser8

A    0
D    1
C    2
Name: NY, dtype: int64

In [51]:
dframe5 - ser8

    A  D  C
NY  0  0  0
SF  3  3  3
LA  6  6  6